In [26]:
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [27]:
# import dataset
df=pd.read_csv('homeprice.txt')
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [28]:
# first we need data preprocessing
# now fill the bedrooms nall value
meadin_bedroom=df.bedrooms.median()
df.bedrooms=df.bedrooms.fillna(meadin_bedroom)
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [53]:
x_train=train_test_split(df[['area','bedrooms','age']])
x_train
y_train=train_test_split(df['price'])
y_train

[1    565000
 4    760000
 2    610000
 0    550000
 Name: price, dtype: int64,
 3    595000
 5    810000
 Name: price, dtype: int64]

In [38]:
reg=LinearRegression()
reg.fit(df.drop('price',axis='columns'),df.price)
reg

LinearRegression()

In [39]:
df.price

0    550000
1    565000
2    610000
3    595000
4    760000
5    810000
Name: price, dtype: int64

In [40]:
df.drop('price',axis='columns')

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.0   18
3  3600       3.0   30
4  4000       5.0    8
5  4100       6.0    8

In [54]:
reg.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [55]:
reg.intercept_

221323.00186540443

# Find price of home with 3000 sqr ft area, 3 bedrooms, 40 year old

In [58]:
reg.predict([[3000,3,40]])

array([498408.25158031])

In [59]:
112.06244194*3000+23388.88007794*3+(-3231.71790863*40)+221323.00186540443

498408.25157402444

In [60]:
# Find price of home with 2500 sqr ft area, 4 bedrooms, 5 year old

reg.predict([[2500,4,5]])

array([578876.03748933])